Function Reference

# Objects - Architectural
| | | |
|---|---|---|
| BeginColumn | BeginFloor | ConvertToUnstyledSlab |
| CreateRoofStyle | CreateSlab | CreateSlabStyle |
| DeleteAllComponents | DeleteComponent | DelObjStoryBound |
| DelObjStoryBounds | GetCompABoundEOffOff | GetCompAltSecFill |
| GetCompAltSecFillCl | GetCompAutoJoinCap | GetCompBotIsRelStory |
| GetCompBoundOffset | GetCompDatTopOfComp | GetCompInsertLoc |
| GetCompInsertLocOff | GetCompManualBound | GetCompMasterSnaps |
| GetComponentAutoBoundEdgeOffset | GetComponentClass | GetComponentFill |
| GetComponentFillColors | GetComponentFollowBottomWallPeaks | GetComponentFollowTopWallPeaks |
| GetComponentFunction | GetComponentManualEdgeOffset | GetComponentMaterial |
| GetComponentName | GetComponentNetArea | GetComponentNetVolume |
| GetComponentPenColors | GetComponentPenStyles <sub>*obsolete in Vectorworks 2019*</sub>| GetComponentPenWeights |
| GetComponents | GetComponentTexture | GetComponentUseFillClassAttr |
| GetComponentUsePenClassAttr | GetComponentWallBottomOffset | GetComponentWallTopOffset |
| GetComponentWidth | GetCompPenStylesN | GetCompSecFillChgPt |
| GetCompTopIsRelStory | GetCompUseClassASF | GetCompUseClassASFCl |
| GetCompUseClassFCl | GetCompUseClassFill | GetCompUseClassLPCl |
| GetCompUseClassLPS | GetCompUseClassLPW | GetCompUseClassRPCl |
| GetCompUseClassRPS | GetCompUseClassRPW | GetCompWallAssBound |
| GetCompWallAssMod | GetCoreWallComponent | GetDatumRoofComp |
| GetDatumSlabComponent | GetDefGenStoryBound | GetInsertLocComp |
| GetNumberOfComponents | GetObjBoundElevation | GetObjStoryBound |
| GetObjStoryBoundsAt | GetObjStoryBoundsCnt | GetRoofPreferences |
| GetRoofPrefStyle | GetSlabHeight | GetSlabPreferences |
| GetSlabPreferencesStyle | GetSlabStyle | GetStoryLayerInfo |
| GetTaperedComponent | GetWallPreferences | HasObjStoryBound |
| HasObjStoryBounds | InsertNewComponent <sub>*obsolete in Vectorworks 2014*</sub>| InsertNewComponentN |
| ModifySlab | SetCompABoundEOffOff | SetCompAltSecFill |
| SetCompAltSecFillCl | SetCompAutoJoinCap | SetCompBotIsRelStory |
| SetCompBoundOffset | SetCompDatTopOfComp | SetCompInsertLoc |
| SetCompInsertLocOff | SetCompManualBound | SetCompMasterSnaps |
| SetComponentAutoBoundEdgeOffset | SetComponentClass | SetComponentFill |
| SetComponentFillColors | SetComponentFollowBottomWallPeaks | SetComponentFollowTopWallPeaks |
| SetComponentFunction | SetComponentManualEdgeOffset | SetComponentMaterial |
| SetComponentName | SetComponentPenColors | SetComponentPenStyles <sub>*obsolete in Vectorworks 2019*</sub>|
| SetComponentPenWeights | SetComponentTexture | SetComponentUseFillClassAttr |
| SetComponentUsePenClassAttr | SetComponentWallBottomOffset | SetComponentWallTopOffset |
| SetComponentWidth | SetCompPenStylesN | SetCompSecFillChgPt |
| SetCompTopIsRelStory | SetCompUseClassASF | SetCompUseClassASFCl |
| SetCompUseClassFCl | SetCompUseClassFill | SetCompUseClassLPCl |
| SetCompUseClassLPS | SetCompUseClassLPW | SetCompUseClassRPCl |
| SetCompUseClassRPS | SetCompUseClassRPW | SetCompWallAssBound |
| SetCompWallAssMod | SetCoreWallComponent | SetDatumRoofComp |
| SetDatumSlabComponent | SetDefGenStoryBound | SetInsertLocComp |
| SetObjectStoryBound | SetRoofPrefStyle | SetSlabHeight |
| SetSlabPreferencesStyle | SetSlabStyle | SetTaperedComponent |
| SlabFromPoly | SyncMatrixToBound